class Article {
  int id = 0;
  int articleNo = 0;
  String title = '';
  String subTitle = '';
  String content = '';

  Article({required this.id, required this.articleNo, required this.title, required this.subTitle, required this.content});

  Map<String, dynamic> toMap() {
    return {
      'article_id': id,
      'article_no': articleNo,
      'article_title': title,
      'article_subtitle': subTitle,
      'article_content': content,
    };
  }

  @override
  String toString() {
    return 'Dog{id: $id, name: $title, age: $subTitle}';
  }
}



/*List<Article> articles = [
  Article(
      id: 18,
      title: 'Стаття 18',
      subTitle: 'Основні обов’язки поліцейського',
      content:
          '3. Звертаючись до особи, або у разі звернення особи до поліцейського, поліцейський зобов’язаний назвати своє прізвище, посаду, спеціальне звання та пред’явити на її вимогу службове посвідчення, надавши можливість ознайомитися з викладеною в ньому інформацією, не випускаючи його з рук.'),
  Article(
      id: 31,
      title: 'Стаття 31',
      subTitle: 'Превентивні поліцейські заходи',
      content:
          '2. Під час проведення превентивних поліцейських заходів поліція зобов’язана повідомити особі про причини застосування до неї превентивних заходів, а також довести до її відома нормативно-правові акти, на підставі яких застосовуються такі заходи.'),
  Article(id: 35, title: 'Стаття 35', subTitle: 'Зупинення транспортного засобу', content: """
  <h2>1. Поліцейський може зупиняти транспортні засоби у разі:</h2>
        1. якщо водій порушив Правила дорожнього руху;<br>
        2. якщо є очевидні ознаки, що свідчать про технічну несправність транспортного засобу;<>br
        3. якщо є інформація, що свідчить про причетність водія або пасажирів транспортного засобу до вчинення дорожньо-транспортної пригоди, кримінального чи адміністративного правопорушення, або якщо є інформація, що свідчить про те, що транспортний засіб чи вантаж можуть бути об’єктом чи знаряддям учинення дорожньо-транспортної пригоди, кримінального чи адміністративного правопорушення;<br>
        4. якщо транспортний засіб перебуває в розшуку;<br>
        5. якщо необхідно здійснити опитування водія чи пасажирів про обставини вчинення дорожньо-транспортної пригоди, кримінального чи адміністративного правопорушення, свідками якого вони є або могли бути;<br>
        6. якщо необхідно залучити водія транспортного засобу до надання допомоги іншим учасникам дорожнього руху або поліцейським або як свідка під час оформлення протоколів про адміністративні правопорушення чи матеріалів дорожньо-транспортних пригод;<br>
        7. якщо уповноважений орган державної влади прийняв рішення про обмеження чи заборону руху;<br>
        8. якщо спосіб закріплення вантажу на транспортному засобі створює небезпеку для інших учасників дорожнього руху;<br>
        9. порушення порядку визначення і використання на транспортному засобі спеціальних світлових або звукових сигнальних пристроїв;<br>
        10. якщо зупинка транспортного засобу, який зареєстрований в іншій країні, здійснюється з метою виявлення його передачі у володіння, користування або розпорядження особам, які не ввозили такий транспортний засіб на митну територію України або не поміщували в митний режим транзиту.'<br>

          <p>3. Поліцейський зобов’язаний поінформувати водія про конкретну причину зупинення ним транспортного засобу з детальним описом підстави зупинки, визначеної у цій статті.</p>"""),
];*/
